{
    "projects": [
        {
            "title": "Event Management API",
            "description": "A RESTful API built with Express and PostgreSQL, designed for managing users, events, and subscriptions. This project includes JWT-based authentication, role-based access control, and CRUD operations with pagination. It also features a database installation and seeding process, along with comprehensive API documentation using Swagger.",
            "technologies": ["Express", "Node.js", "Sequelize", "Postgres", "Swagger"],
            "link": "https://github.com/giovaniohira/event-management-api"
        },
        {
            "title": "Fast Pages CMS",
            "description": "A full content management system built with Node.js, Express, and Mustache for server-side templating. The system includes secure user authentication, content management, and database integration with PostgreSQL.",
            "technologies": ["Express", "Node.js", "Postgres", "Mustache"],
            "link": "https://github.com/dvisantana/projetoback-cms"
        },
        {
            "title": "Term.ooo Solver",
            "description": "A solver for the popular word-guessing game Termooo, built in Python as part of a study about web scraping with Selenium lib. The app implements algorithms to analyze word history and suggest optimal guesses.",
            "technologies": ["Python", "Selenium"],
            "link": "https://github.com/giovaniohira/termooo-solver"
        },
        {
            "title": "Typespeed",
            "description": "A typing game based on React, where the player must type words correctly within a time limit.",
            "technologies": ["React", "Gemini API"],
            "link": "https://github.com/giovaniohira/typespeed"
        }
    ],
    "experiences": [
        {
            "role": "Fullstack Developer - XP Inc.",
            "description": "I completed an intensive bootcamp focused on fullstack development, where I built hosting systems and REST APIs.",
            "technologies": ["C#", "SQL", "Docker", "Azure", "NextJS", "MongoDB","SQL Server", "Typescript", "TDD"],
            "date": "AUG - NOV 2024"
        },
        {
            "role": "Backend Developer - Readfy",
            "description": "I developed a scalable and efficient library management system using Java and PostgreSQL. The system included features for managing books, borrowers, and loans, with role-based access control and optimized database queries to ensure fast performance for large datasets.",
            "technologies": ["Java", "PostgreSQL"],
            "date": "MAR - OCT 2023"
        }
    ]
}
